tests/Integration/OutboundPaymentsIntegrationTest.php

<?php

//
// WARNING: Do not edit by hand, this file was generated by Crank:
// https://github.com/gocardless/crank
//

namespace GoCardlessPro\Integration;

class OutboundPaymentsIntegrationTest extends IntegrationTestBase
{
    public function testResourceModelExists()
    {
        $obj = new \GoCardlessPro\Resources\OutboundPayment(array());
        $this->assertNotNull($obj);
    }

    public function testOutboundPaymentsCreate()
    {
        $fixture = $this->loadJsonFixture('outbound_payments')->create;
        $this->stub_request($fixture);

        $service = $this->client->outboundPayments();
        $response = call_user_func_array(array($service, 'create'), (array)$fixture->url_params);

        $body = $fixture->body->outbound_payments;

        $this->assertInstanceOf('\GoCardlessPro\Resources\OutboundPayment', $response);


        if (property_exists($body, 'amount')) {
            $this->assertEquals($body->amount, $response->amount);
        }

        if (property_exists($body, 'created_at')) {
            $this->assertEquals($body->created_at, $response->created_at);
        }

        if (property_exists($body, 'currency')) {
            $this->assertEquals($body->currency, $response->currency);
        }

        if (property_exists($body, 'description')) {
            $this->assertEquals($body->description, $response->description);
        }

        if (property_exists($body, 'execution_date')) {
            $this->assertEquals($body->execution_date, $response->execution_date);
        }

        if (property_exists($body, 'id')) {
            $this->assertEquals($body->id, $response->id);
        }

        if (property_exists($body, 'is_withdrawal')) {
            $this->assertEquals($body->is_withdrawal, $response->is_withdrawal);
        }

        if (property_exists($body, 'links')) {
            $this->assertEquals($body->links, $response->links);
        }

        if (property_exists($body, 'metadata')) {
            $this->assertEquals($body->metadata, $response->metadata);
        }

        if (property_exists($body, 'reference')) {
            $this->assertEquals($body->reference, $response->reference);
        }

        if (property_exists($body, 'scheme')) {
            $this->assertEquals($body->scheme, $response->scheme);
        }

        if (property_exists($body, 'status')) {
            $this->assertEquals($body->status, $response->status);
        }

        if (property_exists($body, 'verifications')) {
            $this->assertEquals($body->verifications, $response->verifications);
        }


        $expectedPathRegex = $this->extract_resource_fixture_path_regex($fixture);
        $dispatchedRequest = $this->history[0]['request'];
        $this->assertMatchesRegularExpression($expectedPathRegex, $dispatchedRequest->getUri()->getPath());
    }

    public function testOutboundPaymentsCreateWithIdempotencyConflict()
    {
        $fixture = $this->loadJsonFixture('outbound_payments')->create;

        $idempotencyConflictResponseFixture = $this->loadFixture('idempotent_creation_conflict_invalid_state_error');

        // The POST request responds with a 409 to our original POST, due to an idempotency conflict
        $this->mock->append(new \GuzzleHttp\Psr7\Response(409, [], $idempotencyConflictResponseFixture));

        // The client makes a second request to fetch the resource that was already
        // created using our idempotency key. It responds with the created resource,
        // which looks just like the response for a successful POST request.
        $this->mock->append(new \GuzzleHttp\Psr7\Response(200, [], json_encode($fixture->body)));

        $service = $this->client->outboundPayments();
        $response = call_user_func_array(array($service, 'create'), (array)$fixture->url_params);
        $body = $fixture->body->outbound_payments;

        $this->assertInstanceOf('\GoCardlessPro\Resources\OutboundPayment', $response);

        if (property_exists($body, 'amount')) {
            $this->assertEquals($body->amount, $response->amount);
        }
        if (property_exists($body, 'created_at')) {
            $this->assertEquals($body->created_at, $response->created_at);
        }
        if (property_exists($body, 'currency')) {
            $this->assertEquals($body->currency, $response->currency);
        }
        if (property_exists($body, 'description')) {
            $this->assertEquals($body->description, $response->description);
        }
        if (property_exists($body, 'execution_date')) {
            $this->assertEquals($body->execution_date, $response->execution_date);
        }
        if (property_exists($body, 'id')) {
            $this->assertEquals($body->id, $response->id);
        }
        if (property_exists($body, 'is_withdrawal')) {
            $this->assertEquals($body->is_withdrawal, $response->is_withdrawal);
        }
        if (property_exists($body, 'links')) {
            $this->assertEquals($body->links, $response->links);
        }
        if (property_exists($body, 'metadata')) {
            $this->assertEquals($body->metadata, $response->metadata);
        }
        if (property_exists($body, 'reference')) {
            $this->assertEquals($body->reference, $response->reference);
        }
        if (property_exists($body, 'scheme')) {
            $this->assertEquals($body->scheme, $response->scheme);
        }
        if (property_exists($body, 'status')) {
            $this->assertEquals($body->status, $response->status);
        }
        if (property_exists($body, 'verifications')) {
            $this->assertEquals($body->verifications, $response->verifications);
        }


        $expectedPathRegex = $this->extract_resource_fixture_path_regex($fixture);
        $conflictRequest = $this->history[0]['request'];
        $this->assertMatchesRegularExpression($expectedPathRegex, $conflictRequest->getUri()->getPath());
        $getRequest = $this->history[1]['request'];
        $this->assertEquals($getRequest->getUri()->getPath(), '/outbound_payments/ID123');
    }

    public function testOutboundPaymentsWithdraw()
    {
        $fixture = $this->loadJsonFixture('outbound_payments')->withdraw;
        $this->stub_request($fixture);

        $service = $this->client->outboundPayments();
        $response = call_user_func_array(array($service, 'withdraw'), (array)$fixture->url_params);

        $body = $fixture->body->outbound_payments;

        $this->assertInstanceOf('\GoCardlessPro\Resources\OutboundPayment', $response);


        if (property_exists($body, 'amount')) {
            $this->assertEquals($body->amount, $response->amount);
        }

        if (property_exists($body, 'created_at')) {
            $this->assertEquals($body->created_at, $response->created_at);
        }

        if (property_exists($body, 'currency')) {
            $this->assertEquals($body->currency, $response->currency);
        }

        if (property_exists($body, 'description')) {
            $this->assertEquals($body->description, $response->description);
        }

        if (property_exists($body, 'execution_date')) {
            $this->assertEquals($body->execution_date, $response->execution_date);
        }

        if (property_exists($body, 'id')) {
            $this->assertEquals($body->id, $response->id);
        }

        if (property_exists($body, 'is_withdrawal')) {
            $this->assertEquals($body->is_withdrawal, $response->is_withdrawal);
        }

        if (property_exists($body, 'links')) {
            $this->assertEquals($body->links, $response->links);
        }

        if (property_exists($body, 'metadata')) {
            $this->assertEquals($body->metadata, $response->metadata);
        }

        if (property_exists($body, 'reference')) {
            $this->assertEquals($body->reference, $response->reference);
        }

        if (property_exists($body, 'scheme')) {
            $this->assertEquals($body->scheme, $response->scheme);
        }

        if (property_exists($body, 'status')) {
            $this->assertEquals($body->status, $response->status);
        }

        if (property_exists($body, 'verifications')) {
            $this->assertEquals($body->verifications, $response->verifications);
        }


        $expectedPathRegex = $this->extract_resource_fixture_path_regex($fixture);
        $dispatchedRequest = $this->history[0]['request'];
        $this->assertMatchesRegularExpression($expectedPathRegex, $dispatchedRequest->getUri()->getPath());
    }


    public function testOutboundPaymentsCancel()
    {
        $fixture = $this->loadJsonFixture('outbound_payments')->cancel;
        $this->stub_request($fixture);

        $service = $this->client->outboundPayments();
        $response = call_user_func_array(array($service, 'cancel'), (array)$fixture->url_params);

        $body = $fixture->body->outbound_payments;

        $this->assertInstanceOf('\GoCardlessPro\Resources\OutboundPayment', $response);


        if (property_exists($body, 'amount')) {
            $this->assertEquals($body->amount, $response->amount);
        }

        if (property_exists($body, 'created_at')) {
            $this->assertEquals($body->created_at, $response->created_at);
        }

        if (property_exists($body, 'currency')) {
            $this->assertEquals($body->currency, $response->currency);
        }

        if (property_exists($body, 'description')) {
            $this->assertEquals($body->description, $response->description);
        }

        if (property_exists($body, 'execution_date')) {
            $this->assertEquals($body->execution_date, $response->execution_date);
        }

        if (property_exists($body, 'id')) {
            $this->assertEquals($body->id, $response->id);
        }

        if (property_exists($body, 'is_withdrawal')) {
            $this->assertEquals($body->is_withdrawal, $response->is_withdrawal);
        }

        if (property_exists($body, 'links')) {
            $this->assertEquals($body->links, $response->links);
        }

        if (property_exists($body, 'metadata')) {
            $this->assertEquals($body->metadata, $response->metadata);
        }

        if (property_exists($body, 'reference')) {
            $this->assertEquals($body->reference, $response->reference);
        }

        if (property_exists($body, 'scheme')) {
            $this->assertEquals($body->scheme, $response->scheme);
        }

        if (property_exists($body, 'status')) {
            $this->assertEquals($body->status, $response->status);
        }

        if (property_exists($body, 'verifications')) {
            $this->assertEquals($body->verifications, $response->verifications);
        }


        $expectedPathRegex = $this->extract_resource_fixture_path_regex($fixture);
        $dispatchedRequest = $this->history[0]['request'];
        $this->assertMatchesRegularExpression($expectedPathRegex, $dispatchedRequest->getUri()->getPath());
    }


    public function testOutboundPaymentsApprove()
    {
        $fixture = $this->loadJsonFixture('outbound_payments')->approve;
        $this->stub_request($fixture);

        $service = $this->client->outboundPayments();
        $response = call_user_func_array(array($service, 'approve'), (array)$fixture->url_params);

        $body = $fixture->body->outbound_payments;

        $this->assertInstanceOf('\GoCardlessPro\Resources\OutboundPayment', $response);


        if (property_exists($body, 'amount')) {
            $this->assertEquals($body->amount, $response->amount);
        }

        if (property_exists($body, 'created_at')) {
            $this->assertEquals($body->created_at, $response->created_at);
        }

        if (property_exists($body, 'currency')) {
            $this->assertEquals($body->currency, $response->currency);
        }

        if (property_exists($body, 'description')) {
            $this->assertEquals($body->description, $response->description);
        }

        if (property_exists($body, 'execution_date')) {
            $this->assertEquals($body->execution_date, $response->execution_date);
        }

        if (property_exists($body, 'id')) {
            $this->assertEquals($body->id, $response->id);
        }

        if (property_exists($body, 'is_withdrawal')) {
            $this->assertEquals($body->is_withdrawal, $response->is_withdrawal);
        }

        if (property_exists($body, 'links')) {
            $this->assertEquals($body->links, $response->links);
        }

        if (property_exists($body, 'metadata')) {
            $this->assertEquals($body->metadata, $response->metadata);
        }

        if (property_exists($body, 'reference')) {
            $this->assertEquals($body->reference, $response->reference);
        }

        if (property_exists($body, 'scheme')) {
            $this->assertEquals($body->scheme, $response->scheme);
        }

        if (property_exists($body, 'status')) {
            $this->assertEquals($body->status, $response->status);
        }

        if (property_exists($body, 'verifications')) {
            $this->assertEquals($body->verifications, $response->verifications);
        }


        $expectedPathRegex = $this->extract_resource_fixture_path_regex($fixture);
        $dispatchedRequest = $this->history[0]['request'];
        $this->assertMatchesRegularExpression($expectedPathRegex, $dispatchedRequest->getUri()->getPath());
    }


    public function testOutboundPaymentsGet()
    {
        $fixture = $this->loadJsonFixture('outbound_payments')->get;
        $this->stub_request($fixture);

        $service = $this->client->outboundPayments();
        $response = call_user_func_array(array($service, 'get'), (array)$fixture->url_params);

        $body = $fixture->body->outbound_payments;

        $this->assertInstanceOf('\GoCardlessPro\Resources\OutboundPayment', $response);


        if (property_exists($body, 'amount')) {
            $this->assertEquals($body->amount, $response->amount);
        }

        if (property_exists($body, 'created_at')) {
            $this->assertEquals($body->created_at, $response->created_at);
        }

        if (property_exists($body, 'currency')) {
            $this->assertEquals($body->currency, $response->currency);
        }

        if (property_exists($body, 'description')) {
            $this->assertEquals($body->description, $response->description);
        }

        if (property_exists($body, 'execution_date')) {
            $this->assertEquals($body->execution_date, $response->execution_date);
        }

        if (property_exists($body, 'id')) {
            $this->assertEquals($body->id, $response->id);
        }

        if (property_exists($body, 'is_withdrawal')) {
            $this->assertEquals($body->is_withdrawal, $response->is_withdrawal);
        }

        if (property_exists($body, 'links')) {
            $this->assertEquals($body->links, $response->links);
        }

        if (property_exists($body, 'metadata')) {
            $this->assertEquals($body->metadata, $response->metadata);
        }

        if (property_exists($body, 'reference')) {
            $this->assertEquals($body->reference, $response->reference);
        }

        if (property_exists($body, 'scheme')) {
            $this->assertEquals($body->scheme, $response->scheme);
        }

        if (property_exists($body, 'status')) {
            $this->assertEquals($body->status, $response->status);
        }

        if (property_exists($body, 'verifications')) {
            $this->assertEquals($body->verifications, $response->verifications);
        }


        $expectedPathRegex = $this->extract_resource_fixture_path_regex($fixture);
        $dispatchedRequest = $this->history[0]['request'];
        $this->assertMatchesRegularExpression($expectedPathRegex, $dispatchedRequest->getUri()->getPath());
    }


    public function testOutboundPaymentsList()
    {
        $fixture = $this->loadJsonFixture('outbound_payments')->list;
        $this->stub_request($fixture);

        $service = $this->client->outboundPayments();
        $response = call_user_func_array(array($service, 'list'), (array)$fixture->url_params);

        $body = $fixture->body->outbound_payments;

        $records = $response->records;
        $this->assertInstanceOf('\GoCardlessPro\Core\ListResponse', $response);
        $this->assertInstanceOf('\GoCardlessPro\Resources\OutboundPayment', $records[0]);
        if (!is_null($fixture->body) && property_exists($fixture->body, 'meta') && !is_null($fixture->body->meta)) {
            $this->assertEquals($fixture->body->meta->cursors->before, $response->before);
            $this->assertEquals($fixture->body->meta->cursors->after, $response->after);
        }



        foreach (range(0, count($body) - 1) as $num) {
            $record = $records[$num];

            if (isset($body[$num]->amount)) {
                $this->assertEquals($body[$num]->amount, $record->amount);
            }

            if (isset($body[$num]->created_at)) {
                $this->assertEquals($body[$num]->created_at, $record->created_at);
            }

            if (isset($body[$num]->currency)) {
                $this->assertEquals($body[$num]->currency, $record->currency);
            }

            if (isset($body[$num]->description)) {
                $this->assertEquals($body[$num]->description, $record->description);
            }

            if (isset($body[$num]->execution_date)) {
                $this->assertEquals($body[$num]->execution_date, $record->execution_date);
            }

            if (isset($body[$num]->id)) {
                $this->assertEquals($body[$num]->id, $record->id);
            }

            if (isset($body[$num]->is_withdrawal)) {
                $this->assertEquals($body[$num]->is_withdrawal, $record->is_withdrawal);
            }

            if (isset($body[$num]->links)) {
                $this->assertEquals($body[$num]->links, $record->links);
            }

            if (isset($body[$num]->metadata)) {
                $this->assertEquals($body[$num]->metadata, $record->metadata);
            }

            if (isset($body[$num]->reference)) {
                $this->assertEquals($body[$num]->reference, $record->reference);
            }

            if (isset($body[$num]->scheme)) {
                $this->assertEquals($body[$num]->scheme, $record->scheme);
            }

            if (isset($body[$num]->status)) {
                $this->assertEquals($body[$num]->status, $record->status);
            }

            if (isset($body[$num]->verifications)) {
                $this->assertEquals($body[$num]->verifications, $record->verifications);
            }
        }

        $expectedPathRegex = $this->extract_resource_fixture_path_regex($fixture);
        $dispatchedRequest = $this->history[0]['request'];
        $this->assertMatchesRegularExpression($expectedPathRegex, $dispatchedRequest->getUri()->getPath());
    }


    public function testOutboundPaymentsUpdate()
    {
        $fixture = $this->loadJsonFixture('outbound_payments')->update;
        $this->stub_request($fixture);

        $service = $this->client->outboundPayments();
        $response = call_user_func_array(array($service, 'update'), (array)$fixture->url_params);

        $body = $fixture->body->outbound_payments;

        $this->assertInstanceOf('\GoCardlessPro\Resources\OutboundPayment', $response);


        if (property_exists($body, 'amount')) {
            $this->assertEquals($body->amount, $response->amount);
        }

        if (property_exists($body, 'created_at')) {
            $this->assertEquals($body->created_at, $response->created_at);
        }

        if (property_exists($body, 'currency')) {
            $this->assertEquals($body->currency, $response->currency);
        }

        if (property_exists($body, 'description')) {
            $this->assertEquals($body->description, $response->description);
        }

        if (property_exists($body, 'execution_date')) {
            $this->assertEquals($body->execution_date, $response->execution_date);
        }

        if (property_exists($body, 'id')) {
            $this->assertEquals($body->id, $response->id);
        }

        if (property_exists($body, 'is_withdrawal')) {
            $this->assertEquals($body->is_withdrawal, $response->is_withdrawal);
        }

        if (property_exists($body, 'links')) {
            $this->assertEquals($body->links, $response->links);
        }

        if (property_exists($body, 'metadata')) {
            $this->assertEquals($body->metadata, $response->metadata);
        }

        if (property_exists($body, 'reference')) {
            $this->assertEquals($body->reference, $response->reference);
        }

        if (property_exists($body, 'scheme')) {
            $this->assertEquals($body->scheme, $response->scheme);
        }

        if (property_exists($body, 'status')) {
            $this->assertEquals($body->status, $response->status);
        }

        if (property_exists($body, 'verifications')) {
            $this->assertEquals($body->verifications, $response->verifications);
        }


        $expectedPathRegex = $this->extract_resource_fixture_path_regex($fixture);
        $dispatchedRequest = $this->history[0]['request'];
        $this->assertMatchesRegularExpression($expectedPathRegex, $dispatchedRequest->getUri()->getPath());
    }


    public function testOutboundPaymentsStats()
    {
        $fixture = $this->loadJsonFixture('outbound_payments')->stats;
        $this->stub_request($fixture);

        $service = $this->client->outboundPayments();
        $response = call_user_func_array(array($service, 'stats'), (array)$fixture->url_params);

        $body = $fixture->body->outbound_payments;

        $this->assertInstanceOf('\GoCardlessPro\Resources\OutboundPayment', $response);


        if (property_exists($body, 'amount')) {
            $this->assertEquals($body->amount, $response->amount);
        }

        if (property_exists($body, 'created_at')) {
            $this->assertEquals($body->created_at, $response->created_at);
        }

        if (property_exists($body, 'currency')) {
            $this->assertEquals($body->currency, $response->currency);
        }

        if (property_exists($body, 'description')) {
            $this->assertEquals($body->description, $response->description);
        }

        if (property_exists($body, 'execution_date')) {
            $this->assertEquals($body->execution_date, $response->execution_date);
        }

        if (property_exists($body, 'id')) {
            $this->assertEquals($body->id, $response->id);
        }

        if (property_exists($body, 'is_withdrawal')) {
            $this->assertEquals($body->is_withdrawal, $response->is_withdrawal);
        }

        if (property_exists($body, 'links')) {
            $this->assertEquals($body->links, $response->links);
        }

        if (property_exists($body, 'metadata')) {
            $this->assertEquals($body->metadata, $response->metadata);
        }

        if (property_exists($body, 'reference')) {
            $this->assertEquals($body->reference, $response->reference);
        }

        if (property_exists($body, 'scheme')) {
            $this->assertEquals($body->scheme, $response->scheme);
        }

        if (property_exists($body, 'status')) {
            $this->assertEquals($body->status, $response->status);
        }

        if (property_exists($body, 'verifications')) {
            $this->assertEquals($body->verifications, $response->verifications);
        }


        $expectedPathRegex = $this->extract_resource_fixture_path_regex($fixture);
        $dispatchedRequest = $this->history[0]['request'];
        $this->assertMatchesRegularExpression($expectedPathRegex, $dispatchedRequest->getUri()->getPath());
    }
}
